tutorials/lagrangian/reactingParcelFilmFoam/evaporationTest/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  dev                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

5
(
    right
    {
        type            wall;
        nFaces          40;
        startFace       6280;
    }
    top
    {
        type            wall;
        nFaces          3200;
        startFace       6320;
    }
    left
    {
        type            wall;
        nFaces          40;
        startFace       9520;
    }
    frontAndBack
    {
        type            wall;
        nFaces          160;
        startFace       9560;
    }
    region0_to_wallFilmRegion_wallFilmFaces
    {
        type            directMappedWall;
        nFaces          3200;
        startFace       9720;
        sampleMode      nearestPatchFace;
        sampleRegion    wallFilmRegion;
        samplePatch     region0_to_wallFilmRegion_wallFilmFaces;
        offsets         
3200
(
(-0 -8.67361738e-19 -0)
(-1.734723476e-18 -0 -0)
(-0 6.938893904e-18 -0)
(-0 -0 -0)
(-0 1.387778781e-17 -0)
(-8.67361738e-19 -0 -0)
(-8.67361738e-19 -1.387778781e-17 -0)
(-8.67361738e-19 -1.387778781e-17 -0)
(-0 -1.387778781e-17 -0)
(-8.67361738e-19 -4.163336342e-17 -0)
(-1.734723476e-18 -2.775557562e-17 -0)
(-1.734723476e-18 -0 -0)
(-1.734723476e-18 -0 -0)
(-1.734723476e-18 -2.775557562e-17 -0)
(-1.734723476e-18 -0 -0)
(-1.734723476e-18 -0 -0)
(-1.734723476e-18 -0 -0)
(-1.734723476e-18 -0 -0)
(-1.734723476e-18 -2.775557562e-17 -0)
(-1.734723476e-18 -0 -0)
(-8.67361738e-19 -5.551115123e-17 -0)
(-0 -0 -0)
(-8.67361738e-19 -5.551115123e-17 -0)
(-1.734723476e-18 5.551115123e-17 -0)
(-8.67361738e-19 -0 -0)
(-0 -5.551115123e-17 -0)
(-8.67361738e-19 -5.551115123e-17 -0)
(-1.734723476e-18 -0 -0)
(-0 -0 -0)
(-1.734723476e-18 -0 -0)
(-8.67361738e-19 -0 -0)
(-8.67361738e-19 -5.551115123e-17 -0)
(-0 -0 -0)
(-8.67361738e-19 -5.551115123e-17 -0)
(-1.734723476e-18 -0 -0)
(-0 -0 -0)
(-8.67361738e-19 -1.110223025e-16 -0)
(-8.67361738e-19 -5.551115123e-17 -0)
(-0 -0 -0)
(-8.67361738e-19 -0 -0)
(3.469446952e-18 -8.67361738e-19 -0)
(-3.469446952e-18 -0 -0)
(-0 6.938893904e-18 -0)
(-3.469446952e-18 -0 -0)
(-3.469446952e-18 1.387778781e-17 -0)
(-3.469446952e-18 -0 -0)
(-3.469446952e-18 -1.387778781e-17 -0)
(-3.469446952e-18 -1.387778781e-17 -0)
(-0 -1.387778781e-17 -0)
(-3.469446952e-18 -4.163336342e-17 -0)
(-3.469446952e-18 -2.775557562e-17 -0)
(-0 -0 -0)
(-0 -0 -0)
(-0 -2.775557562e-17 -0)
(-3.469446952e-18 -0 -0)
(-0 -0 -0)
(-0 -0 -0)
(-3.469446952e-18 -0 -0)
(-0 -2.775557562e-17 -0)
(-0 -0 -0)
(-0 -5.551115123e-17 -0)
(-3.469446952e-18 -0 -0)
(-0 -5.551115123e-17 -0)
(-0 5.551115123e-17 -0)
(-0 -0 -0)
(-3.469446952e-18 -5.551115123e-17 -0)
(-0 -5.551115123e-17 -0)
(-0 -0 -0)
(-3.469446952e-18 -0 -0)
(-0 -0 -0)
(-0 -0 -0)
(-0 -5.551115123e-17 -0)
(-3.469446952e-18 -0 -0)
(-0 -5.551115123e-17 -0)
(-0 -0 -0)
(-3.469446952e-18 -0 -0)
(-0 -1.110223025e-16 -0)
(-0 -5.551115123e-17 -0)
(-3.469446952e-18 -0 -0)
(-0 -0 -0)
(-0 -8.67361738e-19 -0)
(-6.938893904e-18 -0 -0)
(-6.938893904e-18 6.938893904e-18 -0)
(-0 -0 -0)
(-0 1.387778781e-17 -0)
(-0 -0 -0)
(-6.938893904e-18 -1.387778781e-17 -0)
(6.938893904e-18 -1.387778781e-17 -0)
(-0 -1.387778781e-17 -0)
(-0 -4.163336342e-17 -0)
(-0 -2.775557562e-17 -0)
(-0 -0 -0)
(-0 -0 -0)
(-0 -2.775557562e-17 -0)
(-0 -0 -0)
(-0 -0 -0)
(-0 -0 -0)
(-0 -0 -0)
...
)
;
    }
)

// ************************************************************************* //
