tutorials/lagrangian/reactingParcelFilmFoam/evaporationTest/constant/foam.inp
species
(
    O2
    H2O
    N2
);

reactions
{}

