tutorials/lagrangian/reactingParcelFilmFoam/evaporationTest/constant/reactingCloud1Properties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  dev                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      reactingCloud1Properties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solution
{
    active          false;

    integrationSchemes
    {
        U               Euler;
        T               Analytical;
    }
}

constantProperties
{
    parcelTypeId    1;

    rhoMin          1e-15;
    TMin            200;
    pMin            1000;
    minParticleMass 1e-15;

    rho0            1000;
    T0              300;
    Cp0             4187;

    epsilon0        1;
    f0              0.5;

    Pr              0.7;
    Tvap            273;
    Tbp             373;
    youngsModulus   0;
    poissonsRatio   0;

    constantVolume  false;
}

particleForces
{
    gravity         on;
    virtualMass     off;
    pressureGradient off;
    paramagnetic    off;
}

subModels
{
    InjectionModel  none;

    DragModel       none;

    DispersionModel none;

    PatchInteractionModel none;

    CollisionModel  none;

    HeatTransferModel none;

    CompositionModel none;

    PhaseChangeModel none;

    PostProcessingModel none;

    SurfaceFilmModel none;

    radiation       off;
}


// ************************************************************************* //
